# Brewfile
tap "homebrew/bundle"
tap "homebrew/cask"

# Brews
brew "git"                    # Version control - https://git-scm.com/
brew "gh"                     # GitHub CLI - https://cli.github.com/
brew "fzf"                    # Fuzzy finder - https://github.com/junegunn/fzf
brew "ripgrep"                # Fast text search - https://github.com/BurntSushi/ripgrep
brew "bat"                    # Syntax highlighting cat - https://github.com/sharkdp/bat
brew "eza"                    # Modern ls replacement - https://github.com/eza-community/eza
brew "fd"                     # Fast find replacement - https://github.com/sharkdp/fd
brew "jq"                     # JSON processor - https://stedolan.github.io/jq/
brew "zsh"                    # Shell - https://www.zsh.org/
brew "stow"                   # Dotfile symlink manager - https://www.gnu.org/software/stow/
brew "mise"                   # Runtime version manager - https://mise.jdx.dev/
brew "tmux"                   # Terminal multiplexer - https://github.com/tmux/tmux
brew "neovim"                 # Modern Vim - https://neovim.io/
brew "uv"                     # Fast Python package manager - https://github.com/astral-sh/uv
brew "poetry"                 # Python dependency management - https://python-poetry.org/
brew "awscli"                 # AWS command line interface - https://docs.aws.amazon.com/cli/

# Casks
cask "cursor"                 # AI-first code editor - https://cursor.sh/
cask "warp"                   # GPU-accelerated terminal - https://www.warp.dev/
cask "visual-studio-code"     # Code editor - https://code.visualstudio.com/
cask "docker"                 # Container platform - https://www.docker.com/products/docker-desktop/
cask "font-jetbrains-mono-nerd-font"  # Developer font - https://www.nerdfonts.com/
cask "google-chrome"          # Web browser - https://www.google.com/chrome/
cask "1password"              # Password manager - https://1password.com/
